experiments/results/logs/burst-hpa-002/wrk2.txt
Running 2m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 6043.811ms, rate sampling interval: 14794ms
  Thread calibration: mean lat.: 6290.800ms, rate sampling interval: 16383ms
  Thread calibration: mean lat.: 6149.734ms, rate sampling interval: 16162ms
  Thread calibration: mean lat.: 6246.563ms, rate sampling interval: 16400ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94m    27.68s    1.73m    57.29%
    Req/Sec     3.12      0.32     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95m 
 75.000%    1.35m 
 90.000%    1.57m 
 99.000%    1.70m 
 99.900%    1.71m 
 99.990%    1.73m 
 99.999%    1.73m 
100.000%    1.73m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9256.959     0.000000            1         1.00
   18284.543     0.100000          167         1.11
   26378.239     0.200000          332         1.25
   37158.911     0.300000          500         1.43
   46956.543     0.400000          665         1.67
   57212.927     0.500000          830         2.00
   61931.519     0.550000          913         2.22
   65896.447     0.600000          996         2.50
   69992.447     0.650000         1080         2.86
   75104.255     0.700000         1163         3.33
   80936.959     0.750000         1246         4.00
   83623.935     0.775000         1288         4.44
   86048.767     0.800000         1329         5.00
   87818.239     0.825000         1370         5.71
   89522.175     0.850000         1411         6.67
   92340.223     0.875000         1453         8.00
   93323.263     0.887500         1474         8.89
   94437.375     0.900000         1496        10.00
   96468.991     0.912500         1516        11.43
   98041.855     0.925000         1536        13.33
   99221.503     0.937500         1563        16.00
   99418.111     0.943750         1569        17.78
  100007.935     0.950000         1578        20.00
  100335.615     0.956250         1589        22.86
  100663.295     0.962500         1601        26.67
  100925.439     0.968750         1610        32.00
  101056.511     0.971875         1615        35.56
  101253.119     0.975000         1619        40.00
  101449.727     0.978125         1625        45.71
  101580.799     0.981250         1629        53.33
  101711.871     0.984375         1636        64.00
  101777.407     0.985938         1637        71.11
  101842.943     0.987500         1640        80.00
  101908.479     0.989062         1643        91.43
  102236.159     0.990625         1645       106.67
  102629.375     0.992188         1648       128.00
  102694.911     0.992969         1650       142.22
  102694.911     0.993750         1650       160.00
  102760.447     0.994531         1652       182.86
  102825.983     0.995313         1656       213.33
  102825.983     0.996094         1656       256.00
  102825.983     0.996484         1656       284.44
  102825.983     0.996875         1656       320.00
  102825.983     0.997266         1656       365.71
  102891.519     0.997656         1658       426.67
  102891.519     0.998047         1658       512.00
  102891.519     0.998242         1658       568.89
  102891.519     0.998437         1658       640.00
  102891.519     0.998633         1658       731.43
  103022.591     0.998828         1659       853.33
  103022.591     0.999023         1659      1024.00
  103022.591     0.999121         1659      1137.78
  103022.591     0.999219         1659      1280.00
  103022.591     0.999316         1659      1462.86
  103874.559     0.999414         1660      1706.67
  103874.559     1.000000         1660          inf
#[Mean    =    56474.444, StdDeviation   =    27676.436]
#[Max     =   103809.024, Total count    =         1660]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1764 requests in 2.00m, 18.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 4173
Requests/sec:     14.70
Transfer/sec:    154.38KB